modm-ext/archive-stmicro-svd/header_stm32h757xx.svd
      <fields>
        <field>
          <name>PERF</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SERF</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TERF</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CLRFR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR0</name>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR1</name>
        <addressOffset>0x104</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR2</name>
        <addressOffset>0x108</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR3</name>
        <addressOffset>0x10c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR4</name>
        <addressOffset>0x110</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR5</name>
        <addressOffset>0x114</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR6</name>
        <addressOffset>0x118</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR7</name>
        <addressOffset>0x11c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR8</name>
        <addressOffset>0x120</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR9</name>
        <addressOffset>0x124</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR10</name>
        <addressOffset>0x128</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR11</name>
        <addressOffset>0x12c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR12</name>
        <addressOffset>0x130</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR13</name>
        <addressOffset>0x134</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR14</name>
        <addressOffset>0x138</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR15</name>
        <addressOffset>0x13c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR16</name>
        <addressOffset>0x140</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR17</name>
        <addressOffset>0x144</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR18</name>
        <addressOffset>0x148</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR19</name>
        <addressOffset>0x14c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR20</name>
        <addressOffset>0x150</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR21</name>
        <addressOffset>0x154</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR22</name>
        <addressOffset>0x158</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR23</name>
        <addressOffset>0x15c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR24</name>
        <addressOffset>0x160</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR25</name>
        <addressOffset>0x164</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR26</name>
        <addressOffset>0x168</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR27</name>
        <addressOffset>0x16c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR28</name>
        <addressOffset>0x170</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR29</name>
        <addressOffset>0x174</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR30</name>
        <addressOffset>0x178</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DINR31</name>
        <addressOffset>0x17c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR0</name>
        <addressOffset>0x180</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR1</name>
        <addressOffset>0x184</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR2</name>
        <addressOffset>0x188</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR3</name>
        <addressOffset>0x18c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR4</name>
        <addressOffset>0x190</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR5</name>
        <addressOffset>0x194</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR6</name>
        <addressOffset>0x198</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR7</name>
        <addressOffset>0x19c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR8</name>
        <addressOffset>0x1a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR9</name>
        <addressOffset>0x1a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR10</name>
        <addressOffset>0x1a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR11</name>
        <addressOffset>0x1ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR12</name>
        <addressOffset>0x1b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR13</name>
        <addressOffset>0x1b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR14</name>
        <addressOffset>0x1b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR15</name>
        <addressOffset>0x1bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR16</name>
        <addressOffset>0x1c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR17</name>
        <addressOffset>0x1c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR18</name>
        <addressOffset>0x1c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR19</name>
        <addressOffset>0x1cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR20</name>
        <addressOffset>0x1d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR21</name>
        <addressOffset>0x1d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR22</name>
        <addressOffset>0x1d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR23</name>
        <addressOffset>0x1dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR24</name>
        <addressOffset>0x1e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR25</name>
        <addressOffset>0x1e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR26</name>
        <addressOffset>0x1e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR27</name>
        <addressOffset>0x1ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR28</name>
        <addressOffset>0x1f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR29</name>
        <addressOffset>0x1f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR30</name>
        <addressOffset>0x1f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DOUTR31</name>
        <addressOffset>0x1fc</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>FDCAN1</name>
      <baseAddress>0x4000a000</baseAddress>
      <register>
        <name>CREL</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DAY</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>MON</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>YEAR</name>
          <bitOffset>16</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>SUBSTEP</name>
          <bitOffset>20</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>STEP</name>
          <bitOffset>24</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>REL</name>
          <bitOffset>28</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
      </fields>
      <register>
        <name>ENDN</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>ETV</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>DBTP</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DSJW</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>DTSEG2</name>
          <bitOffset>4</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>DTSEG1</name>
          <bitOffset>8</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>DBRP</name>
          <bitOffset>16</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>TDC</name>
          <bitOffset>23</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>TEST</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>LBCK</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TX</name>
          <bitOffset>5</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>RX</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>RWD</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>WDC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>WDV</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>CCCR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>INIT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CCE</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ASM</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CSA</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CSR</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>MON</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DAR</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TEST</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FDOE</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BRSE</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PXHD</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EFBI</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXP</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NISO</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>NBTP</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>NTSEG2</name>
          <bitOffset>0</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>NTSEG1</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>NBRP</name>
          <bitOffset>16</bitOffset>
          <bitWidth>9</bitWidth>
        </field>
        <field>
          <name>NSJW</name>
          <bitOffset>25</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
      </fields>
      <register>
        <name>TSCC</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TSS</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>TCP</name>
          <bitOffset>16</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
      </fields>
      <register>
        <name>TSCV</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TSC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>TOCC</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>ETOC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TOS</name>
          <bitOffset>1</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>TOP</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>TOCV</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TOC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>ECR</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TEC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>REC</name>
          <bitOffset>8</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>RP</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CEL</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>PSR</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>LEC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>ACT</name>
          <bitOffset>3</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>EP</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EW</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BO</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DLEC</name>
          <bitOffset>8</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>RESI</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RBRS</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>REDL</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PXE</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TDCV</name>
          <bitOffset>16</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDCR</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TDCF</name>
          <bitOffset>0</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>TDCO</name>
          <bitOffset>8</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
      </fields>
      <register>
        <name>IR</name>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>RF0N</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RF0W</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RF0F</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RF0L</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RF1N</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RF1W</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RF1F</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RF1L</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HPM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TC</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCF</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TFE</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TEFN</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TEFW</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TEFF</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TEFL</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TSW</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>MRAF</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TOO</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DRX</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ELO</name>
          <bitOffset>22</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EP</name>
          <bitOffset>23</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EW</name>
          <bitOffset>24</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BO</name>
          <bitOffset>25</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WDI</name>
          <bitOffset>26</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PEA</name>
          <bitOffset>27</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PED</name>
          <bitOffset>28</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ARA</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>IE</name>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
      </register>
