modm-ext/archive-stmicro-svd/header_stm32h757xx.svd
      <fields>
        <field>
          <name>TCLKPOST0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCLKPOST1</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCLKPOST2</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCLKPOST3</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCLKPOST4</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCLKPOST5</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCLKPOST6</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TCLKPOST7</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>WPCR.4</name>
        <addressOffset>0x428</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>WRPCR</name>
        <addressOffset>0x430</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>PLLEN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PLL_NDIV0</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PLL_NDIV1</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PLL_NDIV2</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PLL_NDIV3</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PLL_NDIV4</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PLL_NDIV5</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PLL_NDIV6</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PLL_IDF0</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PLL_IDF1</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PLL_IDF2</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PLL_IDF3</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PLL_ODF0</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PLL_ODF1</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>REGEN</name>
          <bitOffset>24</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>LTDC</name>
      <baseAddress>0x50001000</baseAddress>
      <register>
        <name>SSCR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>VSH</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>HSW</name>
          <bitOffset>16</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>BPCR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>AVBP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>AHBP</name>
          <bitOffset>16</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>AWCR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>AAH</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>AAW</name>
          <bitOffset>16</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>TWCR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TOTALH</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>TOTALW</name>
          <bitOffset>16</bitOffset>
          <bitWidth>12</bitWidth>
        </field>
      </fields>
      <register>
        <name>GCR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>LTDCEN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DBW</name>
          <bitOffset>4</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>DGW</name>
          <bitOffset>8</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>DRW</name>
          <bitOffset>12</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>DEN</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PCPOL</name>
          <bitOffset>28</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DEPOL</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VSPOL</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HSPOL</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>SRCR</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>IMR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VBR</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>BCCR</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BCBLUE</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>BCGREEN</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>BCRED</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>IER</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>LIE</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FUIE</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TERRIE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RRIE</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>ISR</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>LIF</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FUIF</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TERRIF</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RRIF</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>ICR</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CLIF</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CFUIF</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CTERRIF</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CRRIF</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>LIPCR</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>LIPOS</name>
          <bitOffset>0</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
      </fields>
      <register>
        <name>CPSR</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CYPOS</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>CXPOS</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>CDSR</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>VDES</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HDES</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VSYNCS</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HSYNCS</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CR1</name>
        <addressOffset>0x84</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>WHPCR1</name>
        <addressOffset>0x88</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>WVPCR1</name>
        <addressOffset>0x90</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CKCR1</name>
        <addressOffset>0x9c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>PFCR1</name>
        <addressOffset>0xac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CACR1</name>
        <addressOffset>0xc0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DCCR1</name>
        <addressOffset>0xd8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BFCR1</name>
        <addressOffset>0xf4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2</name>
        <addressOffset>0x104</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>WHPCR2</name>
        <addressOffset>0x108</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>WVPCR2</name>
        <addressOffset>0x110</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CFBAR1</name>
        <addressOffset>0x11c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CKCR2</name>
        <addressOffset>0x11c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>PFCR2</name>
        <addressOffset>0x12c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CACR2</name>
        <addressOffset>0x140</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CFBLR1</name>
        <addressOffset>0x148</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DCCR2</name>
        <addressOffset>0x158</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BFCR2</name>
        <addressOffset>0x174</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CFBLNR1</name>
        <addressOffset>0x178</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CFBAR2</name>
        <addressOffset>0x19c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLUTWR1</name>
        <addressOffset>0x1b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CFBLR2</name>
        <addressOffset>0x1c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CFBLNR2</name>
        <addressOffset>0x1f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLUTWR2</name>
        <addressOffset>0x238</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>WWDG1</name>
      <baseAddress>0x50003000</baseAddress>
      <register>
        <name>CR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>T</name>
          <bitOffset>0</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>WDGA</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>CFR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>W</name>
          <bitOffset>0</bitOffset>
          <bitWidth>7</bitWidth>
        </field>
        <field>
          <name>EWI</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WDGTB</name>
          <bitOffset>11</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
      </fields>
      <register>
        <name>SR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>EWIF</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>GPV</name>
      <baseAddress>0x51000000</baseAddress>
      <register>
        <name>AXI_PERIPH_ID_4</name>
        <addressOffset>0x1fd0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_PERIPH_ID_5</name>
        <addressOffset>0x1fd4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_PERIPH_ID_6</name>
        <addressOffset>0x1fd8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_PERIPH_ID_7</name>
        <addressOffset>0x1fdc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_PERIPH_ID_0</name>
        <addressOffset>0x1fe0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_PERIPH_ID_1</name>
        <addressOffset>0x1fe4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_PERIPH_ID_2</name>
        <addressOffset>0x1fe8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_PERIPH_ID_3</name>
        <addressOffset>0x1fec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_COMP_ID_0</name>
        <addressOffset>0x1ff0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_COMP_ID_1</name>
        <addressOffset>0x1ff4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_COMP_ID_2</name>
        <addressOffset>0x1ff8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_COMP_ID_3</name>
        <addressOffset>0x1ffc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_TARG1_FN_MOD_ISS_BM</name>
        <addressOffset>0x2008</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_TARG1_FN_MOD2</name>
        <addressOffset>0x2024</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_TARG1_FN_MOD_LB</name>
        <addressOffset>0x202c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_TARG1_FN_MOD</name>
        <addressOffset>0x2108</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_TARG2_FN_MOD_ISS_BM</name>
        <addressOffset>0x3008</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_TARG2_FN_MOD2</name>
        <addressOffset>0x3024</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_TARG2_FN_MOD_LB</name>
        <addressOffset>0x302c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_TARG2_FN_MOD</name>
        <addressOffset>0x3108</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_TARG3_FN_MOD_ISS_BM</name>
        <addressOffset>0x4008</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_TARG4_FN_MOD_ISS_BM</name>
        <addressOffset>0x5008</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_TARG5_FN_MOD_ISS_BM</name>
        <addressOffset>0x6008</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_TARG6_FN_MOD_ISS_BM</name>
        <addressOffset>0x7008</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_TARG7_FN_MOD_ISS_BM</name>
        <addressOffset>0x8008</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_TARG7_FN_MOD2</name>
        <addressOffset>0x8024</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_TARG7_FN_MOD_LB</name>
        <addressOffset>0x802c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_TARG7_FN_MOD</name>
        <addressOffset>0x8108</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI1_FN_MOD2</name>
        <addressOffset>0x42024</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI1_FN_MOD_AHB</name>
        <addressOffset>0x42028</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI1_READ_QOS</name>
        <addressOffset>0x42100</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI1_WRITE_QOS</name>
        <addressOffset>0x42104</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI1_FN_MOD</name>
        <addressOffset>0x42108</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI2_READ_QOS</name>
        <addressOffset>0x43100</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI2_WRITE_QOS</name>
        <addressOffset>0x43104</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI2_FN_MOD</name>
        <addressOffset>0x43108</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI3_FN_MOD2</name>
        <addressOffset>0x44024</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI3_FN_MOD_AHB</name>
        <addressOffset>0x44028</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI3_READ_QOS</name>
        <addressOffset>0x44100</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI3_WRITE_QOS</name>
        <addressOffset>0x44104</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI3_FN_MOD</name>
        <addressOffset>0x44108</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI4_READ_QOS</name>
        <addressOffset>0x45100</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI4_WRITE_QOS</name>
        <addressOffset>0x45104</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI4_FN_MOD</name>
        <addressOffset>0x45108</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI5_READ_QOS</name>
        <addressOffset>0x46100</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI5_WRITE_QOS</name>
        <addressOffset>0x46104</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI5_FN_MOD</name>
        <addressOffset>0x46108</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI6_READ_QOS</name>
        <addressOffset>0x47100</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI6_WRITE_QOS</name>
        <addressOffset>0x47104</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI6_FN_MOD</name>
        <addressOffset>0x47108</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI7_READ_QOS</name>
        <addressOffset>0x48100</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI7_WRITE_QOS</name>
        <addressOffset>0x48104</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AXI_INI7_FN_MOD</name>
        <addressOffset>0x48108</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>MDMA</name>
      <baseAddress>0x52000000</baseAddress>
      <register>
        <name>GISR0</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
